#+TITLE: Validation 
#+AUTHOR: Nick Tiwari
#+OPTIONS: H:2 toc:t num:t
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: CambridgeUS
#+EXCLUDE_TAGS: noexport
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col)
#+BIND: org-beamer-frame-default-options "allowframebreaks"

** Set Frame Breaks                                                :noexport:
#+BEGIN_SRC emacs-lisp
(setq org-beamer-frame-default-options "allowframebreaks,label=")
#+END_SRC

#+RESULTS:
: allowframebreaks,label=


*** Awk Code
#+BEGIN_SRC sh
cd /home/nick/Documents/DOEIonomers/emcautomated/polymer/validation

# This awk script returns the bonds/atom indices
# matching a specific type of bond
grep -oh -P '.{0,13}c-s.{0,1}' bonds.txt

#+END_SRC

#+RESULTS:
| -f}    |  {700 |  701 | c-s} |
| }      | {5508 | 5509 | c-s} |
| }      | {7404 | 7405 | c-s} |
| {11260 | 11261 | c-s} |      |
| {11916 | 11917 | c-s} |      |
| {14172 | 14173 | c-s} |      |


